# EA_DataAccSave

## Description
Saves data to accessory. The function saves the energy data for the handle who is corresponding to the accessory index.

```pascal
PROCEDURE EA_DataAccSave(acc : INTEGER);
```

```python
def vs.EA_DataAccSave(acc):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |

## Examples
```pascal
EA_DataAccSave(1);
```
```python
import vs

# Saves data to accessory.
acc = 1

vs.EA_DataAccSave(acc)
```

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library